/**
注释
 */

// 注释的写法： 
// 1.写在代码的上一行，注释要写清楚点
// 2.长注释 注意要换行

// 亲爱的维护者：
// 如果你尝试了对这段程序进行‘优化’，
// 并认识到这种企图是大错特错，请增加
// 下面这个计数器的个数，用来对后来人进行警告：
// 浪费在这里的总时间 = 39h

/** * 致终于来到这里的勇敢的人：
 你是被上帝选中的人，英勇的、不辞劳苦的、不眠不修的来修改
 我们这最棘手的代码的编程骑士。你，我们的救世主，人中之龙，
 我要对你说：永远不要放弃，永远不要对自己失望，永远不要逃走，辜负了自己。
 永远不要哭啼，永远不要说再见。永远不要说谎来伤害自己。 */

/*
怎么没人说百度首页的console下写的······

一张网页，要经历怎样的过程，才能抵达用户面前？
一位新人，要经历怎样的成长，才能站在技术之巅？
探寻这里的秘密；
体验这里的挑战；
成为这里的主人；
加入百度，加入网页搜索，你，可以影响世界。

all_async_popstate1_88cbae7c.js:89 请将简历发送至 ps_recruiter@baidu.com（ 邮件标题请以“姓名-应聘XX职位-来自console”命名）
all_async_popstate1_88cbae7c.js:89 职位介绍：百度招聘-社招职位
*/


/* When I wrote this, only God and I understood what I was doing
Now, God only knows 

写这段代码的时候，只有上帝和我知道它是干什么的
现在，只有上帝知道了
 */

 
 // 虽然我不想这么做
 // 但是有个讨厌的家伙就要我这么做，迟早会证明，他是错的
 //  2013-9-9


// 喝醉了也要写注释也是蛮敬业的
// drunk, fix later
 

 // 如果你能弄清楚这一段，求求你务必发邮件至
 // aaa@bbb.com告诉我，不胜感激

// 去他妈的，就这样发布吧

// 这个不知道是谁写的，看起来没用，但我不敢删除

/* 魔法，勿动 */

// #define TRUE FALSE //逗一逗调试程序的傻瓜们

/** 2014-11-4鱼香肉丝 */
/** 2014-11-5糖醋排骨*/
/** 2014-11-6扬州炒饭*/
/** 2014-11-9还是糖醋排骨好吃点*/

// 晕了，以后再修改

// 如果这段代码好用，那它是Qin Ting写的。
//如果不好用，我不知道是谁写的。

// “我也不知道这一段是用来干嘛的，但是删了程序就跑不动了”

// 调一个bug，一路追踪到根错误，发现上面写了一句注释：I promise I will fix this one day
// 然后这个code再也没有动过，这个人也已经离职很久了。。。

// 硕鼠首页的HTML注释：
<!--

/**********/**********/**********//**********//**********//**********//**********/
  .--,       .--,
 ( (  \.---./  ) )
  '.__/o   o\__.'
     {=  ^  =}
      >  -  <
     /       \
    //       \\
   //|   .   |\\
   "'\       /'"_.-~^`'-.
      \  _  /--'         `
    ___)( )(___
   (((__) (__)))    高山仰止,景行行止.虽不能至,心向往之。
   
   
   
/**********/**********/**********//**********//**********//**********//**********/



知乎的console很棒哒！

          _____                    _____                    _____                    _____          
         /\    \                  /\    \                  /\    \                  /\    \         
        /::\____\                /::\    \                /::\    \                /::\    \        
       /:::/    /                \:::\    \              /::::\    \              /::::\    \       
      /:::/    /                  \:::\    \            /::::::\    \            /::::::\    \      
     /:::/    /                    \:::\    \          /:::/\:::\    \          /:::/\:::\    \     
    /:::/____/                      \:::\    \        /:::/__\:::\    \        /:::/__\:::\    \    
   /::::\    \                      /::::\    \      /::::\   \:::\    \      /::::\   \:::\    \   
  /::::::\    \   _____    ____    /::::::\    \    /::::::\   \:::\    \    /::::::\   \:::\    \  
 /:::/\:::\    \ /\    \  /\   \  /:::/\:::\    \  /:::/\:::\   \:::\____\  /:::/\:::\   \:::\    \ 
/:::/  \:::\    /::\____\/::\   \/:::/  \:::\____\/:::/  \:::\   \:::|    |/:::/__\:::\   \:::\____\
\::/    \:::\  /:::/    /\:::\  /:::/    \::/    /\::/   |::::\  /:::|____|\:::\   \:::\   \::/    /
 \/____/ \:::\/:::/    /  \:::\/:::/    / \/____/  \/____|:::::\/:::/    /  \:::\   \:::\   \/____/ 
          \::::::/    /    \::::::/    /                 |:::::::::/    /    \:::\   \:::\    \     
           \::::/    /      \::::/____/                  |::|\::::/    /      \:::\   \:::\____\    
           /:::/    /        \:::\    \                  |::| \::/____/        \:::\   \::/    /    
          /:::/    /          \:::\    \                 |::|  ~|               \:::\   \/____/     
         /:::/    /            \:::\    \                |::|   |                \:::\    \         
        /:::/    /              \:::\____\               \::|   |                 \:::\____\        
        \::/    /                \::/    /                \:|   |                  \::/    /        
         \/____/                  \/____/                  \|___|                   \/____/         


想来知乎工作？请发送邮件到 jobs@zhihu.com






/**                           _ooOoo_ 
 *                           o8888888o 
 *                           88" . "88 
 *                           (| -_- |) 
 *                            O\ = /O 
 *                        ____/`---'\____ 
 *                      .   ' \\| |// `. 
 *                       / \\||| : |||// \ 
 *                     / _||||| -:- |||||- \ 
 *                       | | \\\ - /// | | 
 *                     | \_| ''\---/'' | | 
 *                      \ .-\__ `-` ___/-. / 
 *                   ___`. .' /--.--\ `. . __ 
 *                ."" '< `.___\_<|>_/___.' >'"". 
 *               | | : `- \`.;`\ _ /`;.`/ - ` : | | 
 *                 \ \ `-. \_ __\ /__ _/ .-` / / 
 *         ======`-.____`-.___\_____/___.-`____.-'====== 
 *                            `=---=' 
 * 
 *         ............................................. 
 *                  佛祖保佑             永无BUG 
 */ 
